OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1554.h
/*
 * This declarations of the PIC16LF1554 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:07 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16LF1554_H__
#define __PIC16LF1554_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF0_ADDR              0x0000
#define INDF1_ADDR              0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR0_ADDR               0x0004
#define FSR0L_ADDR              0x0004
#define FSR0H_ADDR              0x0005
#define FSR1_ADDR               0x0006
#define FSR1L_ADDR              0x0006
#define FSR1H_ADDR              0x0007
#define BSR_ADDR                0x0008
#define WREG_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PORTA_ADDR              0x000C
#define PORTC_ADDR              0x000E
#define PIR1_ADDR               0x0011
#define PIR2_ADDR               0x0012
#define TMR0_ADDR               0x0015
#define TMR1_ADDR               0x0016
#define TMR1L_ADDR              0x0016
#define TMR1H_ADDR              0x0017
#define T1CON_ADDR              0x0018
#define T1GCON_ADDR             0x0019
#define TMR2_ADDR               0x001A
#define PR2_ADDR                0x001B
#define T2CON_ADDR              0x001C
#define TRISA_ADDR              0x008C
#define TRISC_ADDR              0x008E
#define PIE1_ADDR               0x0091
#define PIE2_ADDR               0x0092
#define OPTION_REG_ADDR         0x0095
#define PCON_ADDR               0x0096
#define WDTCON_ADDR             0x0097
#define OSCCON_ADDR             0x0099
#define OSCSTAT_ADDR            0x009A
#define ADRES_ADDR              0x009B
#define ADRESL_ADDR             0x009B
#define ADRESH_ADDR             0x009C
#define ADCON0_ADDR             0x009D
#define ADCON1_ADDR             0x009E
#define ADCON2_ADDR             0x009F
#define LATA_ADDR               0x010C
#define LATC_ADDR               0x010E
#define BORCON_ADDR             0x0116
#define FVRCON_ADDR             0x0117
#define APFCON_ADDR             0x011D
#define ANSELA_ADDR             0x018C
#define ANSELC_ADDR             0x018E
#define PMADR_ADDR              0x0191
#define PMADRL_ADDR             0x0191
#define PMADRH_ADDR             0x0192
#define PMDAT_ADDR              0x0193
#define PMDATL_ADDR             0x0193
#define PMDATH_ADDR             0x0194
#define PMCON1_ADDR             0x0195
#define PMCON2_ADDR             0x0196
#define RCREG_ADDR              0x0199
#define TXREG_ADDR              0x019A
#define SPBRG_ADDR              0x019B
#define SPBRGL_ADDR             0x019B
#define SPBRGH_ADDR             0x019C
#define RCSTA_ADDR              0x019D
#define TXSTA_ADDR              0x019E
#define BAUDCON_ADDR            0x019F
#define WPUA_ADDR               0x020C
#define SSP1BUF_ADDR            0x0211
#define SSPBUF_ADDR             0x0211
#define SSP1ADD_ADDR            0x0212
#define SSPADD_ADDR             0x0212
#define SSP1MSK_ADDR            0x0213
#define SSPMSK_ADDR             0x0213
#define SSP1STAT_ADDR           0x0214
#define SSPSTAT_ADDR            0x0214
#define SSP1CON1_ADDR           0x0215
#define SSPCON_ADDR             0x0215
#define SSPCON1_ADDR            0x0215
#define SSP1CON2_ADDR           0x0216
#define SSPCON2_ADDR            0x0216
#define SSP1CON3_ADDR           0x0217
#define SSPCON3_ADDR            0x0217
#define IOCAP_ADDR              0x0391
#define IOCAN_ADDR              0x0392
#define IOCAF_ADDR              0x0393
#define PWM1DCL_ADDR            0x0611
#define PWM1DCH_ADDR            0x0612
#define PWM1CON_ADDR            0x0613
#define PWM1CON0_ADDR           0x0613
#define PWM2DCL_ADDR            0x0614
#define PWM2DCH_ADDR            0x0615
#define PWM2CON_ADDR            0x0616
#define PWM2CON0_ADDR           0x0616
#define AAD1CON0_ADDR           0x0711
#define AADCON0_ADDR            0x0711
#define AD1CON0_ADDR            0x0711
#define AADCON1_ADDR            0x0712
#define ADCOMCON_ADDR           0x0712
#define AAD1CON2_ADDR           0x0713
#define AADCON2_ADDR            0x0713
#define AD1CON2_ADDR            0x0713
#define AAD1CON3_ADDR           0x0714
#define AADCON3_ADDR            0x0714
#define AD1CON3_ADDR            0x0714
#define AADSTAT_ADDR            0x0715
#define ADSTAT_ADDR             0x0715
#define AAD1PRE_ADDR            0x0716
#define AADPRE_ADDR             0x0716
#define AD1PRE_ADDR             0x0716
#define AD1PRECON_ADDR          0x0716
#define AAD1ACQ_ADDR            0x0717
#define AADACQ_ADDR             0x0717
#define AD1ACQ_ADDR             0x0717
#define AD1ACQCON_ADDR          0x0717
#define AAD1GRD_ADDR            0x0718
#define AADGRD_ADDR             0x0718
#define AD1GRD_ADDR             0x0718
#define AAD1CAP_ADDR            0x0719
#define AAD1CAPCON_ADDR         0x0719
#define AADCAP_ADDR             0x0719
#define AD1CAPCON_ADDR          0x0719
#define AAD1RES0_ADDR           0x071A
#define AAD1RES0L_ADDR          0x071A
#define AD1RES0_ADDR            0x071A
#define AD1RES0L_ADDR           0x071A
#define ADRES0_ADDR             0x071A
#define AAD1RES0H_ADDR          0x071B
#define AD1RES0H_ADDR           0x071B
#define AAD1RES1_ADDR           0x071C
#define AAD1RES1L_ADDR          0x071C
#define AD1RES1_ADDR            0x071C
#define AD1RES1L_ADDR           0x071C
#define ADRES1_ADDR             0x071C
#define AAD1RES1H_ADDR          0x071D
#define AD1RES1H_ADDR           0x071D
#define AAD1CH_ADDR             0x071E
#define AD1CH_ADDR              0x071E
#define AAD2CON0_ADDR           0x0791
#define AD2CON0_ADDR            0x0791
#define AAD2CON2_ADDR           0x0793
#define AD2CON2_ADDR            0x0793
#define AAD2CON3_ADDR           0x0794
#define AD2CON3_ADDR            0x0794
#define AAD2PRE_ADDR            0x0796
#define AD2PRE_ADDR             0x0796
#define AD2PRECON_ADDR          0x0796
#define AAD2ACQ_ADDR            0x0797
#define AD2ACQ_ADDR             0x0797
#define AD2ACQCON_ADDR          0x0797
#define AAD2GRD_ADDR            0x0798
#define AD2GRD_ADDR             0x0798
#define AAD2CAP_ADDR            0x0799
#define AAD2CAPCON_ADDR         0x0799
#define AD2CAPCON_ADDR          0x0799
#define AAD2RES0_ADDR           0x079A
#define AAD2RES0L_ADDR          0x079A
#define AD2RES0_ADDR            0x079A
#define AD2RES0L_ADDR           0x079A
#define AAD2RES0H_ADDR          0x079B
#define AD2RES0H_ADDR           0x079B
#define AAD2RES1_ADDR           0x079C
#define AAD2RES1L_ADDR          0x079C
#define AD2RES1_ADDR            0x079C
#define AD2RES1L_ADDR           0x079C
#define AAD2RES1H_ADDR          0x079D
#define AD2RES1H_ADDR           0x079D
#define AAD2CH_ADDR             0x079E
#define AD2CH_ADDR              0x079E
#define ICDIO_ADDR              0x0F8C
#define ICDCON0_ADDR            0x0F8D
#define ICDSTAT_ADDR            0x0F91
#define ICDINSTL_ADDR           0x0F96
#define ICDINSTH_ADDR           0x0F97
#define ICDBK0CON_ADDR          0x0F9C
#define ICDBK0L_ADDR            0x0F9D
#define ICDBK0H_ADDR            0x0F9E
#define BSRICDSHAD_ADDR         0x0FE3
#define STATUS_SHAD_ADDR        0x0FE4
#define WREG_SHAD_ADDR          0x0FE5
#define BSR_SHAD_ADDR           0x0FE6
#define PCLATH_SHAD_ADDR        0x0FE7
#define FSR0L_SHAD_ADDR         0x0FE8
#define FSR0H_SHAD_ADDR         0x0FE9
#define FSR1L_SHAD_ADDR         0x0FEA
#define FSR1H_SHAD_ADDR         0x0FEB
#define STKPTR_ADDR             0x0FED
#define TOSL_ADDR               0x0FEE
#define TOSH_ADDR               0x0FEF

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

